Table of Contents
 Class RebarPatternBase
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Represents a base class for Rebar Pattern
public abstract class RebarPatternBase : OpenElementId
Inheritance
object
OpenObject
OpenElementId
RebarPatternBase
Derived
RebarStirrupPattern
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 EndPosition
This defines end position of the pattern. It is the distance from the start point of the group. Its value should be in corelation to PositionMode
public double EndPosition { get; set; }
Property Value
double
 Relative
Mode of defining the position of the pattern false is for absolute length (position) of the pattern (default) true is for relative length (position) of the pattern in range [0 1]
public bool Relative { get; set; }
Property Value
bool
 StartPosition
This defines begin position of the pattern. It is the distance from the start point of the group. Its value should be in corelation to PositionMode
public double StartPosition { get; set; }
Property Value
double
 Edit this page